Revit 2024 API
ParameterFilterUtilities.GetAllFilterableCategories Method
 Returns the set of categories that may be used in a ParameterFilterElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static ICollection<ElementId> GetAllFilterableCategories()
Visual Basic
Public Shared Function GetAllFilterableCategories As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ GetAllFilterableCategories()
Return Value
 The set of all filterable categories.
See Also
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace